remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
/**
 * \file
 *
 * \brief Component description for I2C
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_I2C_COMPONENT_
#define _SAMB11_I2C_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR I2C */
/* ========================================================================== */
/** \addtogroup SAMB11_I2C I2C Master/Slave Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define I2C_I1234
#define REV_I2C                          0x100

/* -------- I2C_TRANSMIT_DATA : (I2C Offset: 0x00) (/W 16) Writes one byte to I2C Transmit Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t TX_DATA:8;                 /**< bit:   0..7  Represents either Tx Data, or Address and Direction if address flag is set.  */
    uint16_t ADDRESS_FLAG:1;            /**< bit:      8  Specifies that tx_data field is used for address and direction. */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} I2C_TRANSMIT_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_TRANSMIT_DATA_OFFSET            0x00                                          /**<  (I2C_TRANSMIT_DATA) Writes one byte to I2C Transmit Data FIFO.   Offset */
#define I2C_TRANSMIT_DATA_RESETVALUE        0x00u                                         /**<  (I2C_TRANSMIT_DATA) Writes one byte to I2C Transmit Data FIFO.   Reset Value */

#define I2C_TRANSMIT_DATA_TX_DATA_Pos       0                                              /**< (I2C_TRANSMIT_DATA) Represents either Tx Data, or Address and Direction if address flag is set.  Position */
#define I2C_TRANSMIT_DATA_TX_DATA_Msk       (0xFFu << I2C_TRANSMIT_DATA_TX_DATA_Pos)       /**< (I2C_TRANSMIT_DATA) Represents either Tx Data, or Address and Direction if address flag is set.  Mask */
#define I2C_TRANSMIT_DATA_TX_DATA(value)    (I2C_TRANSMIT_DATA_TX_DATA_Msk & ((value) << I2C_TRANSMIT_DATA_TX_DATA_Pos))
#define I2C_TRANSMIT_DATA_ADDRESS_FLAG_Pos  8                                              /**< (I2C_TRANSMIT_DATA) Specifies that tx_data field is used for address and direction. Position */
#define I2C_TRANSMIT_DATA_ADDRESS_FLAG_Msk  (0x1u << I2C_TRANSMIT_DATA_ADDRESS_FLAG_Pos)   /**< (I2C_TRANSMIT_DATA) Specifies that tx_data field is used for address and direction. Mask */
#define I2C_TRANSMIT_DATA_ADDRESS_FLAG      I2C_TRANSMIT_DATA_ADDRESS_FLAG_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_DATA_ADDRESS_FLAG_Msk instead */
#define   I2C_TRANSMIT_DATA_ADDRESS_FLAG_0_Val 0x0u                                           /**< (I2C_TRANSMIT_DATA) tx_data field bits 7:0 are Transmit Data  */
#define   I2C_TRANSMIT_DATA_ADDRESS_FLAG_1_Val 0x1u                                           /**< (I2C_TRANSMIT_DATA) tx_data field bit 0 is direction (0: write to slave, 1: read from slave), and bits 7:1 are the Address to transmit.  */
#define I2C_TRANSMIT_DATA_ADDRESS_FLAG_0    (I2C_TRANSMIT_DATA_ADDRESS_FLAG_0_Val << I2C_TRANSMIT_DATA_ADDRESS_FLAG_Pos)  /**< (I2C_TRANSMIT_DATA) tx_data field bits 7:0 are Transmit Data Position  */
#define I2C_TRANSMIT_DATA_ADDRESS_FLAG_1    (I2C_TRANSMIT_DATA_ADDRESS_FLAG_1_Val << I2C_TRANSMIT_DATA_ADDRESS_FLAG_Pos)  /**< (I2C_TRANSMIT_DATA) tx_data field bit 0 is direction (0: write to slave, 1: read from slave), and bits 7:1 are the Address to transmit. Position  */
#define I2C_TRANSMIT_DATA_MASK              0x1FFu                                         /**< \deprecated (I2C_TRANSMIT_DATA) Register MASK  (Use I2C_TRANSMIT_DATA_Msk instead)  */
#define I2C_TRANSMIT_DATA_Msk               0x1FFu                                         /**< (I2C_TRANSMIT_DATA) Register Mask  */

/* -------- I2C_RECEIVE_DATA : (I2C Offset: 0x04) (R/ 8) Read one byte from I2C Receive Data FIFO.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_BYTE:8;                 /**< bit:   0..7  Oldest data in receive FIFO.             */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_RECEIVE_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_RECEIVE_DATA_OFFSET             0x04                                          /**<  (I2C_RECEIVE_DATA) Read one byte from I2C Receive Data FIFO.   Offset */
#define I2C_RECEIVE_DATA_RESETVALUE         0x00u                                         /**<  (I2C_RECEIVE_DATA) Read one byte from I2C Receive Data FIFO.   Reset Value */

#define I2C_RECEIVE_DATA_RX_BYTE_Pos        0                                              /**< (I2C_RECEIVE_DATA) Oldest data in receive FIFO.  Position */
#define I2C_RECEIVE_DATA_RX_BYTE_Msk        (0xFFu << I2C_RECEIVE_DATA_RX_BYTE_Pos)        /**< (I2C_RECEIVE_DATA) Oldest data in receive FIFO.  Mask */
#define I2C_RECEIVE_DATA_RX_BYTE(value)     (I2C_RECEIVE_DATA_RX_BYTE_Msk & ((value) << I2C_RECEIVE_DATA_RX_BYTE_Pos))
#define I2C_RECEIVE_DATA_MASK               0xFFu                                          /**< \deprecated (I2C_RECEIVE_DATA) Register MASK  (Use I2C_RECEIVE_DATA_Msk instead)  */
#define I2C_RECEIVE_DATA_Msk                0xFFu                                          /**< (I2C_RECEIVE_DATA) Register Mask  */

/* -------- I2C_TRANSMIT_STATUS : (I2C Offset: 0x08) (R/ 8) Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL:1;        /**< bit:      0  Active High indication when Tx FIFO can still accepts at least one more character. */
    uint8_t  TX_FIFO_0P25_EMPTY:1;      /**< bit:      1  Active High indication when Tx FIFO is at least quarter empty. Reset when more.  */
    uint8_t  TX_FIFO_0P5_EMPTY:1;       /**< bit:      2  Active High indication when Tx FIFO is at least half empty. Reset when more.  */
    uint8_t  TX_FIFO_0P75_EMPTY:1;      /**< bit:      3  Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  */
    uint8_t  TX_FIFO_EMPTY:1;           /**< bit:      4  Active High indication when Tx FIFO is Empty and has no more character to transmit  */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_TRANSMIT_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_TRANSMIT_STATUS_OFFSET          0x08                                          /**<  (I2C_TRANSMIT_STATUS) Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Offset */
#define I2C_TRANSMIT_STATUS_RESETVALUE      0x00u                                         /**<  (I2C_TRANSMIT_STATUS) Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.   Reset Value */

#define I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos 0                                              /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. Position */
#define I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk (0x1u << I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO can still accepts at least one more character. Mask */
#define I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Msk instead */
#define   I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0_Val 0x0u                                           /**< (I2C_TRANSMIT_STATUS) TX FIFO Full  */
#define   I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1_Val 0x1u                                           /**< (I2C_TRANSMIT_STATUS) TX FIFO not Full  */
#define I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0 (I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_0_Val << I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (I2C_TRANSMIT_STATUS) TX FIFO Full Position  */
#define I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1 (I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_1_Val << I2C_TRANSMIT_STATUS_TX_FIFO_NOT_FULL_Pos)  /**< (I2C_TRANSMIT_STATUS) TX FIFO not Full Position  */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos 1                                              /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Position */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk (0x1u << I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Pos)  /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least quarter empty. Reset when more.  Mask */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_STATUS_TX_FIFO_0P25_EMPTY_Msk instead */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos 2                                              /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Position */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk (0x1u << I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Pos)  /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least half empty. Reset when more.  Mask */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_STATUS_TX_FIFO_0P5_EMPTY_Msk instead */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos 3                                              /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Position */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk (0x1u << I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Pos)  /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is at least three quarters empty. Reset when more.  Mask */
#define I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_STATUS_TX_FIFO_0P75_EMPTY_Msk instead */
#define I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos 4                                              /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Position */
#define I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk (0x1u << I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY_Pos)  /**< (I2C_TRANSMIT_STATUS) Active High indication when Tx FIFO is Empty and has no more character to transmit  Mask */
#define I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY   I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TRANSMIT_STATUS_TX_FIFO_EMPTY_Msk instead */
#define I2C_TRANSMIT_STATUS_MASK            0x1Fu                                          /**< \deprecated (I2C_TRANSMIT_STATUS) Register MASK  (Use I2C_TRANSMIT_STATUS_Msk instead)  */
#define I2C_TRANSMIT_STATUS_Msk             0x1Fu                                          /**< (I2C_TRANSMIT_STATUS) Register Mask  */

