remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
/* -------- I2C_RECEIVE_STATUS : (I2C Offset: 0x0c) (R/ 8) Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY:1;       /**< bit:      0  Active High indication when data is available in Rx FIFO */
    uint8_t  RX_FIFO_0P25_FULL:1;       /**< bit:      1  Active High indication when FIFO is at least quarter full. Reset when less.  */
    uint8_t  RX_FIFO_0P5_FULL:1;        /**< bit:      2  Active High indication when FIFO is at least half full. Reset when less.  */
    uint8_t  RX_FIFO_0P75_FULL:1;       /**< bit:      3  Active High indication when FIFO is at least three quarters full. Reset when less.  */
    uint8_t  FIFO_OVERRUN:1;            /**< bit:      4  Active High indication when character is received but FIFO is full. Reset by reading  the status register.  */
    uint8_t  NAK:1;                     /**< bit:      5  Active High indication when NAK is received. The I2C module will retry transmission  unless transaction aborted by the flush register.  */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_RECEIVE_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_RECEIVE_STATUS_OFFSET           0x0C                                          /**<  (I2C_RECEIVE_STATUS) Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Offset */
#define I2C_RECEIVE_STATUS_RESETVALUE       0x00u                                         /**<  (I2C_RECEIVE_STATUS) Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.   Reset Value */

#define I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos 0                                              /**< (I2C_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO Position */
#define I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk (0x1u << I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Pos)  /**< (I2C_RECEIVE_STATUS) Active High indication when data is available in Rx FIFO Mask */
#define I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_RX_FIFO_NOT_EMPTY_Msk instead */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos 1                                              /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Position */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk (0x1u << I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Pos)  /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least quarter full. Reset when less.  Mask */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_RX_FIFO_0P25_FULL_Msk instead */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos 2                                              /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Position */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk (0x1u << I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Pos)  /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least half full. Reset when less.  Mask */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_RX_FIFO_0P5_FULL_Msk instead */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos 3                                              /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Position */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk (0x1u << I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Pos)  /**< (I2C_RECEIVE_STATUS) Active High indication when FIFO is at least three quarters full. Reset when less.  Mask */
#define I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_RX_FIFO_0P75_FULL_Msk instead */
#define I2C_RECEIVE_STATUS_FIFO_OVERRUN_Pos 4                                              /**< (I2C_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading  the status register.  Position */
#define I2C_RECEIVE_STATUS_FIFO_OVERRUN_Msk (0x1u << I2C_RECEIVE_STATUS_FIFO_OVERRUN_Pos)  /**< (I2C_RECEIVE_STATUS) Active High indication when character is received but FIFO is full. Reset by reading  the status register.  Mask */
#define I2C_RECEIVE_STATUS_FIFO_OVERRUN     I2C_RECEIVE_STATUS_FIFO_OVERRUN_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_FIFO_OVERRUN_Msk instead */
#define I2C_RECEIVE_STATUS_NAK_Pos          5                                              /**< (I2C_RECEIVE_STATUS) Active High indication when NAK is received. The I2C module will retry transmission  unless transaction aborted by the flush register.  Position */
#define I2C_RECEIVE_STATUS_NAK_Msk          (0x1u << I2C_RECEIVE_STATUS_NAK_Pos)           /**< (I2C_RECEIVE_STATUS) Active High indication when NAK is received. The I2C module will retry transmission  unless transaction aborted by the flush register.  Mask */
#define I2C_RECEIVE_STATUS_NAK              I2C_RECEIVE_STATUS_NAK_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RECEIVE_STATUS_NAK_Msk instead */
#define I2C_RECEIVE_STATUS_MASK             0x3Fu                                          /**< \deprecated (I2C_RECEIVE_STATUS) Register MASK  (Use I2C_RECEIVE_STATUS_Msk instead)  */
#define I2C_RECEIVE_STATUS_Msk              0x3Fu                                          /**< (I2C_RECEIVE_STATUS) Register Mask  */

/* -------- I2C_CLOCK_SOURCE_SELECT : (I2C Offset: 0x10) (R/W 8) Clock Source Select -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CLOCK:2;                   /**< bit:   0..1  Clock Used to Generate Divided Clock     */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_CLOCK_SOURCE_SELECT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

