remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
#define I2C_CLOCK_SOURCE_SELECT_OFFSET      0x10                                          /**<  (I2C_CLOCK_SOURCE_SELECT) Clock Source Select  Offset */
#define I2C_CLOCK_SOURCE_SELECT_RESETVALUE  0x00u                                         /**<  (I2C_CLOCK_SOURCE_SELECT) Clock Source Select  Reset Value */

#define I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos   0                                              /**< (I2C_CLOCK_SOURCE_SELECT) Clock Used to Generate Divided Clock Position */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK_Msk   (0x3u << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos)    /**< (I2C_CLOCK_SOURCE_SELECT) Clock Used to Generate Divided Clock Mask */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK(value) (I2C_CLOCK_SOURCE_SELECT_CLOCK_Msk & ((value) << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos))
#define   I2C_CLOCK_SOURCE_SELECT_CLOCK_0_Val 0x0u                                           /**< (I2C_CLOCK_SOURCE_SELECT) 26 MHz Clock  */
#define   I2C_CLOCK_SOURCE_SELECT_CLOCK_1_Val 0x1u                                           /**< (I2C_CLOCK_SOURCE_SELECT) 13 MHz Clock  */
#define   I2C_CLOCK_SOURCE_SELECT_CLOCK_2_Val 0x2u                                           /**< (I2C_CLOCK_SOURCE_SELECT) 6.5 MHz Clock  */
#define   I2C_CLOCK_SOURCE_SELECT_CLOCK_3_Val 0x3u                                           /**< (I2C_CLOCK_SOURCE_SELECT) 3.25 MHz Clock  */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK_0     (I2C_CLOCK_SOURCE_SELECT_CLOCK_0_Val << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (I2C_CLOCK_SOURCE_SELECT) 26 MHz Clock Position  */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK_1     (I2C_CLOCK_SOURCE_SELECT_CLOCK_1_Val << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (I2C_CLOCK_SOURCE_SELECT) 13 MHz Clock Position  */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK_2     (I2C_CLOCK_SOURCE_SELECT_CLOCK_2_Val << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (I2C_CLOCK_SOURCE_SELECT) 6.5 MHz Clock Position  */
#define I2C_CLOCK_SOURCE_SELECT_CLOCK_3     (I2C_CLOCK_SOURCE_SELECT_CLOCK_3_Val << I2C_CLOCK_SOURCE_SELECT_CLOCK_Pos)  /**< (I2C_CLOCK_SOURCE_SELECT) 3.25 MHz Clock Position  */
#define I2C_CLOCK_SOURCE_SELECT_MASK        0x03u                                          /**< \deprecated (I2C_CLOCK_SOURCE_SELECT) Register MASK  (Use I2C_CLOCK_SOURCE_SELECT_Msk instead)  */
#define I2C_CLOCK_SOURCE_SELECT_Msk         0x03u                                          /**< (I2C_CLOCK_SOURCE_SELECT) Register Mask  */

/* -------- I2C_MODULE_ENABLE : (I2C Offset: 0x14) (R/W 8) I2C Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Enables I2C Operation                    */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_MODULE_ENABLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_MODULE_ENABLE_OFFSET            0x14                                          /**<  (I2C_MODULE_ENABLE) I2C Enable  Offset */
#define I2C_MODULE_ENABLE_RESETVALUE        0x00u                                         /**<  (I2C_MODULE_ENABLE) I2C Enable  Reset Value */

#define I2C_MODULE_ENABLE_ENABLE_Pos        0                                              /**< (I2C_MODULE_ENABLE) Enables I2C Operation Position */
#define I2C_MODULE_ENABLE_ENABLE_Msk        (0x1u << I2C_MODULE_ENABLE_ENABLE_Pos)         /**< (I2C_MODULE_ENABLE) Enables I2C Operation Mask */
#define I2C_MODULE_ENABLE_ENABLE            I2C_MODULE_ENABLE_ENABLE_Msk                   /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_MODULE_ENABLE_ENABLE_Msk instead */
#define I2C_MODULE_ENABLE_MASK              0x01u                                          /**< \deprecated (I2C_MODULE_ENABLE) Register MASK  (Use I2C_MODULE_ENABLE_Msk instead)  */
#define I2C_MODULE_ENABLE_Msk               0x01u                                          /**< (I2C_MODULE_ENABLE) Register Mask  */

/* -------- I2C_CLK_DIVIDER : (I2C Offset: 0x18) (R/W 16) Register sets the divide ratio used to generate the sck clock from the module's input clock.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t I2C_DIVIDE_RATIO:16;       /**< bit:  0..15  Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} I2C_CLK_DIVIDER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_CLK_DIVIDER_OFFSET              0x18                                          /**<  (I2C_CLK_DIVIDER) Register sets the divide ratio used to generate the sck clock from the module's input clock.   Offset */
#define I2C_CLK_DIVIDER_RESETVALUE          0x00u                                         /**<  (I2C_CLK_DIVIDER) Register sets the divide ratio used to generate the sck clock from the module's input clock.   Reset Value */

#define I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO_Pos 0                                              /**< (I2C_CLK_DIVIDER) Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  Position */
#define I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO_Msk (0xFFFFu << I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO_Pos)  /**< (I2C_CLK_DIVIDER) Clock Divide Ratio. The input clock signal is divided by (n+1) where n is the value set in  this field.  The minimum division is by 2; a value of 0 is illegal.  Mask */
#define I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO(value) (I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO_Msk & ((value) << I2C_CLK_DIVIDER_I2C_DIVIDE_RATIO_Pos))
#define I2C_CLK_DIVIDER_MASK                0xFFFFu                                        /**< \deprecated (I2C_CLK_DIVIDER) Register MASK  (Use I2C_CLK_DIVIDER_Msk instead)  */
#define I2C_CLK_DIVIDER_Msk                 0xFFFFu                                        /**< (I2C_CLK_DIVIDER) Register Mask  */

/* -------- I2C_MASTER_MODE : (I2C Offset: 0x1c) (R/W 8) Selects I2C Master or Slave Mode.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MASTER_ENABLE:1;           /**< bit:      0  Active High I2C Master Mode Enable       */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_MASTER_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_MASTER_MODE_OFFSET              0x1C                                          /**<  (I2C_MASTER_MODE) Selects I2C Master or Slave Mode.   Offset */
#define I2C_MASTER_MODE_RESETVALUE          0x00u                                         /**<  (I2C_MASTER_MODE) Selects I2C Master or Slave Mode.   Reset Value */

