remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
#define I2C_MASTER_MODE_MASTER_ENABLE_Pos   0                                              /**< (I2C_MASTER_MODE) Active High I2C Master Mode Enable Position */
#define I2C_MASTER_MODE_MASTER_ENABLE_Msk   (0x1u << I2C_MASTER_MODE_MASTER_ENABLE_Pos)    /**< (I2C_MASTER_MODE) Active High I2C Master Mode Enable Mask */
#define I2C_MASTER_MODE_MASTER_ENABLE       I2C_MASTER_MODE_MASTER_ENABLE_Msk              /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_MASTER_MODE_MASTER_ENABLE_Msk instead */
#define   I2C_MASTER_MODE_MASTER_ENABLE_0_Val 0x0u                                           /**< (I2C_MASTER_MODE) I2C Slave  */
#define   I2C_MASTER_MODE_MASTER_ENABLE_1_Val 0x1u                                           /**< (I2C_MASTER_MODE) I2C Master  */
#define I2C_MASTER_MODE_MASTER_ENABLE_0     (I2C_MASTER_MODE_MASTER_ENABLE_0_Val << I2C_MASTER_MODE_MASTER_ENABLE_Pos)  /**< (I2C_MASTER_MODE) I2C Slave Position  */
#define I2C_MASTER_MODE_MASTER_ENABLE_1     (I2C_MASTER_MODE_MASTER_ENABLE_1_Val << I2C_MASTER_MODE_MASTER_ENABLE_Pos)  /**< (I2C_MASTER_MODE) I2C Master Position  */
#define I2C_MASTER_MODE_MASK                0x01u                                          /**< \deprecated (I2C_MASTER_MODE) Register MASK  (Use I2C_MASTER_MODE_Msk instead)  */
#define I2C_MASTER_MODE_Msk                 0x01u                                          /**< (I2C_MASTER_MODE) Register Mask  */

/* -------- I2C_ONBUS : (I2C Offset: 0x20) (R/W 8) Enable/Disable transactions when in Master Mode.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ONBUS_ENABLE:1;            /**< bit:      0  Active High Enable to initiate transactions when in Master Mode. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_ONBUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_ONBUS_OFFSET                    0x20                                          /**<  (I2C_ONBUS) Enable/Disable transactions when in Master Mode.   Offset */
#define I2C_ONBUS_RESETVALUE                0x00u                                         /**<  (I2C_ONBUS) Enable/Disable transactions when in Master Mode.   Reset Value */

#define I2C_ONBUS_ONBUS_ENABLE_Pos          0                                              /**< (I2C_ONBUS) Active High Enable to initiate transactions when in Master Mode. Position */
#define I2C_ONBUS_ONBUS_ENABLE_Msk          (0x1u << I2C_ONBUS_ONBUS_ENABLE_Pos)           /**< (I2C_ONBUS) Active High Enable to initiate transactions when in Master Mode. Mask */
#define I2C_ONBUS_ONBUS_ENABLE              I2C_ONBUS_ONBUS_ENABLE_Msk                     /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_ONBUS_ONBUS_ENABLE_Msk instead */
#define   I2C_ONBUS_ONBUS_ENABLE_0_Val      0x0u                                           /**< (I2C_ONBUS) Master completes current byte and generates stop condition on bus.  */
#define   I2C_ONBUS_ONBUS_ENABLE_1_Val      0x1u                                           /**< (I2C_ONBUS) Master tranmits contents of FIFO until empty.  */
#define I2C_ONBUS_ONBUS_ENABLE_0            (I2C_ONBUS_ONBUS_ENABLE_0_Val << I2C_ONBUS_ONBUS_ENABLE_Pos)  /**< (I2C_ONBUS) Master completes current byte and generates stop condition on bus. Position  */
#define I2C_ONBUS_ONBUS_ENABLE_1            (I2C_ONBUS_ONBUS_ENABLE_1_Val << I2C_ONBUS_ONBUS_ENABLE_Pos)  /**< (I2C_ONBUS) Master tranmits contents of FIFO until empty. Position  */
#define I2C_ONBUS_MASK                      0x01u                                          /**< \deprecated (I2C_ONBUS) Register MASK  (Use I2C_ONBUS_Msk instead)  */
#define I2C_ONBUS_Msk                       0x01u                                          /**< (I2C_ONBUS) Register Mask  */

/* -------- I2C_SLAVE_ADDRESS : (I2C Offset: 0x24) (R/W 8) Configures the I2C slave Address.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ADDRESS:7;                 /**< bit:   0..6  I2C Slave Address                        */
    uint8_t  :1;                        /**< bit:      7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_SLAVE_ADDRESS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_SLAVE_ADDRESS_OFFSET            0x24                                          /**<  (I2C_SLAVE_ADDRESS) Configures the I2C slave Address.   Offset */
#define I2C_SLAVE_ADDRESS_RESETVALUE        0x00u                                         /**<  (I2C_SLAVE_ADDRESS) Configures the I2C slave Address.   Reset Value */

#define I2C_SLAVE_ADDRESS_ADDRESS_Pos       0                                              /**< (I2C_SLAVE_ADDRESS) I2C Slave Address  Position */
#define I2C_SLAVE_ADDRESS_ADDRESS_Msk       (0x7Fu << I2C_SLAVE_ADDRESS_ADDRESS_Pos)       /**< (I2C_SLAVE_ADDRESS) I2C Slave Address  Mask */
#define I2C_SLAVE_ADDRESS_ADDRESS(value)    (I2C_SLAVE_ADDRESS_ADDRESS_Msk & ((value) << I2C_SLAVE_ADDRESS_ADDRESS_Pos))
#define I2C_SLAVE_ADDRESS_MASK              0x7Fu                                          /**< \deprecated (I2C_SLAVE_ADDRESS) Register MASK  (Use I2C_SLAVE_ADDRESS_Msk instead)  */
#define I2C_SLAVE_ADDRESS_Msk               0x7Fu                                          /**< (I2C_SLAVE_ADDRESS) Register Mask  */

/* -------- I2C_STATUS : (I2C Offset: 0x28) (R/ 8) Status of I2C Module.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  I2C_ACTIVE:1;              /**< bit:      0  Active High indicatation that the I2C Module is active. While set, I2C configuration  should not be modified.  */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_STATUS_OFFSET                   0x28                                          /**<  (I2C_STATUS) Status of I2C Module.   Offset */
#define I2C_STATUS_RESETVALUE               0x00u                                         /**<  (I2C_STATUS) Status of I2C Module.   Reset Value */

#define I2C_STATUS_I2C_ACTIVE_Pos           0                                              /**< (I2C_STATUS) Active High indicatation that the I2C Module is active. While set, I2C configuration  should not be modified.  Position */
#define I2C_STATUS_I2C_ACTIVE_Msk           (0x1u << I2C_STATUS_I2C_ACTIVE_Pos)            /**< (I2C_STATUS) Active High indicatation that the I2C Module is active. While set, I2C configuration  should not be modified.  Mask */
#define I2C_STATUS_I2C_ACTIVE               I2C_STATUS_I2C_ACTIVE_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_STATUS_I2C_ACTIVE_Msk instead */
#define I2C_STATUS_MASK                     0x01u                                          /**< \deprecated (I2C_STATUS) Register MASK  (Use I2C_STATUS_Msk instead)  */
#define I2C_STATUS_Msk                      0x01u                                          /**< (I2C_STATUS) Register Mask  */

/* -------- I2C_TX_INTERRUPT_MASK : (I2C Offset: 0x2c) (R/W 8) Enable or Disable the generation of interrupts by the tx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  TX_FIFO_NOT_FULL_MASK:1;   /**< bit:      0  Active High Enable of tx_fifo_not_full interrupt  */
    uint8_t  TX_FIFO_0P25_EMPTY_MASK:1;  /**< bit:      1  Active High Enable of tx_fifo_0p25_empty interrupt  */
    uint8_t  TX_FIFO_0P5_EMPTY_MASK:1;  /**< bit:      2  Active High Enable of tx_fifo_0p5_empty interrupt  */
    uint8_t  TX_FIFO_0P75_EMPTY_MASK:1;  /**< bit:      3  Active High Enable of tx_fifo_0p75_empty interrupt  */
    uint8_t  TX_FIFO_EMPTY_MASK:1;      /**< bit:      4  Active High Enable of tx_fifo_empty interrupt  */
    uint8_t  :3;                        /**< bit:   5..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_TX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_TX_INTERRUPT_MASK_OFFSET        0x2C                                          /**<  (I2C_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Offset */
#define I2C_TX_INTERRUPT_MASK_RESETVALUE    0x00u                                         /**<  (I2C_TX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the tx_status register.   Reset Value */

#define I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos 0                                              /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Position */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk (0x1u << I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Pos)  /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_not_full interrupt  Mask */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TX_INTERRUPT_MASK_TX_FIFO_NOT_FULL_MASK_Msk instead */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos 1                                              /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Position */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk (0x1u << I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Pos)  /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p25_empty interrupt  Mask */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TX_INTERRUPT_MASK_TX_FIFO_0P25_EMPTY_MASK_Msk instead */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos 2                                              /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Position */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk (0x1u << I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Pos)  /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p5_empty interrupt  Mask */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TX_INTERRUPT_MASK_TX_FIFO_0P5_EMPTY_MASK_Msk instead */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos 3                                              /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Position */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk (0x1u << I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Pos)  /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_0p75_empty interrupt  Mask */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TX_INTERRUPT_MASK_TX_FIFO_0P75_EMPTY_MASK_Msk instead */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos 4                                              /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Position */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk (0x1u << I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Pos)  /**< (I2C_TX_INTERRUPT_MASK) Active High Enable of tx_fifo_empty interrupt  Mask */
#define I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_TX_INTERRUPT_MASK_TX_FIFO_EMPTY_MASK_Msk instead */
#define I2C_TX_INTERRUPT_MASK_Msk           0x1Fu                                          /**< (I2C_TX_INTERRUPT_MASK) Register Mask  */

