remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
/* -------- I2C_RX_INTERRUPT_MASK : (I2C Offset: 0x30) (R/W 8) Enable or Disable the generation of interrupts by the rx_status register.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  RX_FIFO_NOT_EMPTY_MASK:1;  /**< bit:      0  Active High Enable of rx_fifo_not_empty interrupt  */
    uint8_t  RX_FIFO_0P25_FULL_MASK:1;  /**< bit:      1  Active High Enable of rx_fifo_0p25_full interrupt  */
    uint8_t  RX_FIFO_0P5_FULL_MASK:1;   /**< bit:      2  Active High Enable of rx_fifo_0p5_full interrupt  */
    uint8_t  RX_FIFO_0P75_FULL_MASK:1;  /**< bit:      3  Active High Enable of rx_fifo_0p75_full interrupt  */
    uint8_t  FIFO_OVERRUN_MASK:1;       /**< bit:      4  Active High Enable of FIFO overrun interrupt  */
    uint8_t  NAK_MASK:1;                /**< bit:      5  Active High Enable NAK interrupt         */
    uint8_t  :2;                        /**< bit:   6..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_RX_INTERRUPT_MASK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_RX_INTERRUPT_MASK_OFFSET        0x30                                          /**<  (I2C_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Offset */
#define I2C_RX_INTERRUPT_MASK_RESETVALUE    0x00u                                         /**<  (I2C_RX_INTERRUPT_MASK) Enable or Disable the generation of interrupts by the rx_status register.   Reset Value */

#define I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos 0                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk (0x1u << I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Pos)  /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_not_empty interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_RX_FIFO_NOT_EMPTY_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos 1                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk (0x1u << I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Pos)  /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p25_full interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_RX_FIFO_0P25_FULL_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos 2                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk (0x1u << I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Pos)  /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p5_full interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_RX_FIFO_0P5_FULL_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos 3                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk (0x1u << I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Pos)  /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of rx_fifo_0p75_full interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_RX_FIFO_0P75_FULL_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos 4                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk (0x1u << I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Pos)  /**< (I2C_RX_INTERRUPT_MASK) Active High Enable of FIFO overrun interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_FIFO_OVERRUN_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_NAK_MASK_Pos  5                                              /**< (I2C_RX_INTERRUPT_MASK) Active High Enable NAK interrupt  Position */
#define I2C_RX_INTERRUPT_MASK_NAK_MASK_Msk  (0x1u << I2C_RX_INTERRUPT_MASK_NAK_MASK_Pos)   /**< (I2C_RX_INTERRUPT_MASK) Active High Enable NAK interrupt  Mask */
#define I2C_RX_INTERRUPT_MASK_NAK_MASK      I2C_RX_INTERRUPT_MASK_NAK_MASK_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_RX_INTERRUPT_MASK_NAK_MASK_Msk instead */
#define I2C_RX_INTERRUPT_MASK_Msk           0x3Fu                                          /**< (I2C_RX_INTERRUPT_MASK) Register Mask  */

/* -------- I2C_FLUSH : (I2C Offset: 0x34) (/W 8) Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted.  -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  I2C_FLUSH:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} I2C_FLUSH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define I2C_FLUSH_OFFSET                    0x34                                          /**<  (I2C_FLUSH) Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted.   Offset */
#define I2C_FLUSH_RESETVALUE                0x00u                                         /**<  (I2C_FLUSH) Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted.   Reset Value */

