remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/i2c.h
#define I2C_FLUSH_I2C_FLUSH_Pos             0                                              /**< (I2C_FLUSH)  Position */
#define I2C_FLUSH_I2C_FLUSH_Msk             (0x1u << I2C_FLUSH_I2C_FLUSH_Pos)              /**< (I2C_FLUSH)  Mask */
#define I2C_FLUSH_I2C_FLUSH                 I2C_FLUSH_I2C_FLUSH_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use I2C_FLUSH_I2C_FLUSH_Msk instead */
#define I2C_FLUSH_MASK                      0x01u                                          /**< \deprecated (I2C_FLUSH) Register MASK  (Use I2C_FLUSH_Msk instead)  */
#define I2C_FLUSH_Msk                       0x01u                                          /**< (I2C_FLUSH) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief I2C hardware registers */
typedef struct {  /* I2C Master/Slave Controller */
  WoReg16 TRANSMIT_DATA;  /**< (I2C Offset: 0x00) Writes one byte to I2C Transmit Data FIFO.  */
  __I  uint8_t  Reserved1[2];
  RoReg8  RECEIVE_DATA;   /**< (I2C Offset: 0x04) Read one byte from I2C Receive Data FIFO.  */
  __I  uint8_t  Reserved2[3];
  RoReg8  TRANSMIT_STATUS; /**< (I2C Offset: 0x08) Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
  __I  uint8_t  Reserved3[3];
  RoReg8  RECEIVE_STATUS; /**< (I2C Offset: 0x0C) Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
  __I  uint8_t  Reserved4[3];
  RwReg8  CLOCK_SOURCE_SELECT; /**< (I2C Offset: 0x10) Clock Source Select */
  __I  uint8_t  Reserved5[3];
  RwReg8  I2C_MODULE_ENABLE; /**< (I2C Offset: 0x14) I2C Enable */
  __I  uint8_t  Reserved6[3];
  RwReg16 I2C_CLK_DIVIDER; /**< (I2C Offset: 0x18) Register sets the divide ratio used to generate the sck clock from the module's input clock.  */
  __I  uint8_t  Reserved7[2];
  RwReg8  I2C_MASTER_MODE; /**< (I2C Offset: 0x1C) Selects I2C Master or Slave Mode.  */
  __I  uint8_t  Reserved8[3];
  RwReg8  I2C_ONBUS;      /**< (I2C Offset: 0x20) Enable/Disable transactions when in Master Mode.  */
  __I  uint8_t  Reserved9[3];
  RwReg8  I2C_SLAVE_ADDRESS; /**< (I2C Offset: 0x24) Configures the I2C slave Address.  */
  __I  uint8_t  Reserved10[3];
  RoReg8  I2C_STATUS;     /**< (I2C Offset: 0x28) Status of I2C Module.  */
  __I  uint8_t  Reserved11[3];
  RwReg8  TX_INTERRUPT_MASK; /**< (I2C Offset: 0x2C) Enable or Disable the generation of interrupts by the tx_status register.  */
  __I  uint8_t  Reserved12[3];
  RwReg8  RX_INTERRUPT_MASK; /**< (I2C Offset: 0x30) Enable or Disable the generation of interrupts by the rx_status register.  */
  __I  uint8_t  Reserved13[3];
  WoReg8  I2C_FLUSH;      /**< (I2C Offset: 0x34) Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted.  */
} I2c;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief I2C hardware registers */
typedef struct {  /* I2C Master/Slave Controller */
  __O  I2C_TRANSMIT_DATA_Type         TRANSMIT_DATA;  /**< Offset: 0x00 ( /W  16) Writes one byte to I2C Transmit Data FIFO.  */
       RoReg8                         Reserved1[0x2];
  __I  I2C_RECEIVE_DATA_Type          RECEIVE_DATA;   /**< Offset: 0x04 (R/    8) Read one byte from I2C Receive Data FIFO.  */
       RoReg8                         Reserved2[0x3];
  __I  I2C_TRANSMIT_STATUS_Type       TRANSMIT_STATUS; /**< Offset: 0x08 (R/    8) Status of the I2C transmitter. Each field can generate an interrupt if corresponding bit in  the Tx interrupt mask register is set.  */
       RoReg8                         Reserved3[0x3];
  __I  I2C_RECEIVE_STATUS_Type        RECEIVE_STATUS; /**< Offset: 0x0C (R/    8) Status of the I2C receiver. Each field can generate an interrupt if corresponding bit in  the Rx interrupt mask register is set.  */
       RoReg8                         Reserved4[0x3];
  __IO I2C_CLOCK_SOURCE_SELECT_Type   CLOCK_SOURCE_SELECT; /**< Offset: 0x10 (R/W   8) Clock Source Select */
       RoReg8                         Reserved5[0x3];
  __IO I2C_MODULE_ENABLE_Type         I2C_MODULE_ENABLE; /**< Offset: 0x14 (R/W   8) I2C Enable */
       RoReg8                         Reserved6[0x3];
  __IO I2C_CLK_DIVIDER_Type           I2C_CLK_DIVIDER; /**< Offset: 0x18 (R/W  16) Register sets the divide ratio used to generate the sck clock from the module's input clock.  */
       RoReg8                         Reserved7[0x2];
  __IO I2C_MASTER_MODE_Type           I2C_MASTER_MODE; /**< Offset: 0x1C (R/W   8) Selects I2C Master or Slave Mode.  */
       RoReg8                         Reserved8[0x3];
  __IO I2C_ONBUS_Type                 I2C_ONBUS;      /**< Offset: 0x20 (R/W   8) Enable/Disable transactions when in Master Mode.  */
       RoReg8                         Reserved9[0x3];
  __IO I2C_SLAVE_ADDRESS_Type         I2C_SLAVE_ADDRESS; /**< Offset: 0x24 (R/W   8) Configures the I2C slave Address.  */
       RoReg8                         Reserved10[0x3];
  __I  I2C_STATUS_Type                I2C_STATUS;     /**< Offset: 0x28 (R/    8) Status of I2C Module.  */
       RoReg8                         Reserved11[0x3];
  __IO I2C_TX_INTERRUPT_MASK_Type     TX_INTERRUPT_MASK; /**< Offset: 0x2C (R/W   8) Enable or Disable the generation of interrupts by the tx_status register.  */
       RoReg8                         Reserved12[0x3];
  __IO I2C_RX_INTERRUPT_MASK_Type     RX_INTERRUPT_MASK; /**< Offset: 0x30 (R/W   8) Enable or Disable the generation of interrupts by the rx_status register.  */
       RoReg8                         Reserved13[0x3];
  __O  I2C_FLUSH_Type                 I2C_FLUSH;      /**< Offset: 0x34 ( /W   8) Writing to this address  flushes the contents of both the Tx and Rx FIFOs. The value written has no effect. Flushing the Tx FIFO will abort ongoing transactions when the current byte has been transmitted.  */
} I2c;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_I2C_COMPONENT_ */
